7.1 Handling Missing Data

In [1]:
import pandas as pd
import numpy as np
string_data= pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [8]:
from numpy import nan as nan

In [9]:
data = pd.Series([1, nan, 3.5, nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [12]:
data[(data.notnull())]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., nan, nan],
                    [nan, nan, nan], [nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4]=nan

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.937771  0.718573  1.261492
1 -0.145149  1.239357 -0.093727
2 -1.645924 -0.323608 -1.877350
3 -1.920829 -0.270124  0.286326
4 -0.844030  0.850521 -1.023707
5  0.633329  1.116593  1.257595
6 -0.005359 -1.087413  0.602752

In [20]:
df.iloc[:4, 1] = nan
df

          0         1         2
0 -0.937771       NaN  1.261492
1 -0.145149       NaN -0.093727
2 -1.645924       NaN -1.877350
3 -1.920829       NaN  0.286326
4 -0.844030  0.850521 -1.023707
5  0.633329  1.116593  1.257595
6 -0.005359 -1.087413  0.602752

In [22]:
df.iloc[:2, 2] = nan
df

          0         1         2
0 -0.937771       NaN       NaN
1 -0.145149       NaN       NaN
2 -1.645924       NaN -1.877350
3 -1.920829       NaN  0.286326
4 -0.844030  0.850521 -1.023707
5  0.633329  1.116593  1.257595
6 -0.005359 -1.087413  0.602752

In [23]:
df.dropna()

          0         1         2
4 -0.844030  0.850521 -1.023707
5  0.633329  1.116593  1.257595
6 -0.005359 -1.087413  0.602752

In [24]:
df.dropna(thresh=2)

          0         1         2
2 -1.645924       NaN -1.877350
3 -1.920829       NaN  0.286326
4 -0.844030  0.850521 -1.023707
5  0.633329  1.116593  1.257595
6 -0.005359 -1.087413  0.602752

In [25]:
df.fillna(0)

          0         1         2
0 -0.937771  0.000000  0.000000
1 -0.145149  0.000000  0.000000
2 -1.645924  0.000000 -1.877350
3 -1.920829  0.000000  0.286326
4 -0.844030  0.850521 -1.023707
5  0.633329  1.116593  1.257595
6 -0.005359 -1.087413  0.602752

In [26]:
df.fillna({1: 0.5, 2:0})

          0         1         2
0 -0.937771  0.500000  0.000000
1 -0.145149  0.500000  0.000000
2 -1.645924  0.500000 -1.877350
3 -1.920829  0.500000  0.286326
4 -0.844030  0.850521 -1.023707
5  0.633329  1.116593  1.257595
6 -0.005359 -1.087413  0.602752

In [34]:
a = df.fillna(0, inplace=False)

In [28]:
df

          0         1         2
0 -0.937771  0.000000  0.000000
1 -0.145149  0.000000  0.000000
2 -1.645924  0.000000 -1.877350
3 -1.920829  0.000000  0.286326
4 -0.844030  0.850521 -1.023707
5  0.633329  1.116593  1.257595
6 -0.005359 -1.087413  0.602752

In [35]:
print(a)

          0         1         2
0 -0.937771  0.000000  0.000000
1 -0.145149  0.000000  0.000000
2 -1.645924  0.000000 -1.877350
3 -1.920829  0.000000  0.286326
4 -0.844030  0.850521 -1.023707
5  0.633329  1.116593  1.257595
6 -0.005359 -1.087413  0.602752

In [36]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  1.319465 -1.335007 -1.072802
1 -0.644180 -0.018931 -1.052329
2 -1.799757  0.895585 -0.145577
3 -1.116211  0.755706  1.226303
4 -0.702015  0.149579 -2.063828
5  1.123013  0.820117 -0.879410

In [39]:
df.iloc[2:, 1] = nan
df.iloc[4:, 2] = nan

In [40]:
df

          0         1         2
0  1.319465 -1.335007 -1.072802
1 -0.644180 -0.018931 -1.052329
2 -1.799757       NaN -0.145577
3 -1.116211       NaN  1.226303
4 -0.702015       NaN       NaN
5  1.123013       NaN       NaN

In [42]:
df.fillna(method='ffill')

          0         1         2
0  1.319465 -1.335007 -1.072802
1 -0.644180 -0.018931 -1.052329
2 -1.799757 -0.018931 -0.145577
3 -1.116211 -0.018931  1.226303
4 -0.702015 -0.018931  1.226303
5  1.123013 -0.018931  1.226303

In [43]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.319465 -1.335007 -1.072802
1 -0.644180 -0.018931 -1.052329
2 -1.799757 -0.018931 -0.145577
3 -1.116211 -0.018931  1.226303
4 -0.702015       NaN  1.226303
5  1.123013       NaN  1.226303

In [44]:
df.fillna(method='bfill')

          0         1         2
0  1.319465 -1.335007 -1.072802
1 -0.644180 -0.018931 -1.052329
2 -1.799757       NaN -0.145577
3 -1.116211       NaN  1.226303
4 -0.702015       NaN       NaN
5  1.123013       NaN       NaN

In [46]:
df.fillna(df.mean())

          0         1         2
0  1.319465 -1.335007 -1.072802
1 -0.644180 -0.018931 -1.052329
2 -1.799757 -0.676969 -0.145577
3 -1.116211 -0.676969  1.226303
4 -0.702015 -0.676969 -0.261101
5  1.123013 -0.676969 -0.261101

In [49]:
data = pd.Series([1., nan, 3,5, nan, 7])
data

0    1.0
1    NaN
2    3.0
3    5.0
4    NaN
5    7.0
dtype: float64

In [50]:
data.fillna(data.mean())

0    1.0
1    4.0
2    3.0
3    5.0
4    4.0
5    7.0
dtype: float64

7.2 Data Transformation

In [51]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [52]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [55]:
data[data.duplicated()]

    k1  k2
6  two   4

In [57]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [58]:
data['v1'] = range(1,8)
data

    k1  k2  v1
0  one   1   1
1  two   1   2
2  one   2   3
3  two   3   4
4  one   3   5
5  two   4   6
6  two   4   7

In [59]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   1
1  two   1   2

In [61]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   1
1  two   1   2
2  one   2   3
3  two   3   4
4  one   3   5
6  two   4   7

In [62]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [63]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [64]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [65]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [66]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [67]:
data = pd.Series([1., -999, 2., -999., -1000, 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [68]:
data.replace(-999, nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [69]:
data.replace([-999, -1000],[nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [72]:
data.replace([-999, -1000], [nan, nan])

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [73]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [74]:
transform = lambda x:x[:4].upper()

In [75]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [76]:
data.rename(index=str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [77]:
data.rename(index={'OHIO':'INDIANA'},
                  columns={'three': 'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [78]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.030465     0.088185    -0.004398    -0.009736
std       1.016025     1.009842     0.991947     0.986364
min      -3.437372    -3.424282    -2.949145    -3.009313
25%      -0.649222    -0.617484    -0.693030    -0.660282
50%       0.029518     0.070459     0.003251    -0.013574
75%       0.743122     0.743826     0.634672     0.670587
max       3.177297     3.769719     3.545677     2.978884

In [79]:
col = data[2]
col[np.abs(col) > 3]

821    3.545677
Name: 2, dtype: float64

In [84]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
63  -2.237348  3.761210 -1.160249 -1.003084
312  1.307716  3.074778 -0.435794  0.965885
326 -3.381561 -0.660976  1.625634  0.872983
373  3.177297  0.804124  0.981326  1.637309
438 -0.133121 -3.424282 -1.492805 -0.256595
516 -3.437372  0.298297  0.065155  0.939844
526 -0.976794  0.324115 -0.032770 -3.009313
742  3.046635 -0.063976 -0.209326 -1.494461
752  0.747859  3.131738  0.260441  0.637444
801 -3.037924  0.016732 -0.700688 -1.178678
821  0.056791  0.929062  3.545677  0.081684
966  0.350718  0.886049  0.341813 -3.005787
971  2.215815  3.769719 -0.605884 -1.364379

In [85]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.031097     0.086872    -0.004943    -0.009721
std       1.012622     1.002822     0.990141     0.986318
min      -3.000000    -3.000000    -2.949145    -3.000000
25%      -0.649222    -0.617484    -0.693030    -0.660282
50%       0.029518     0.070459     0.003251    -0.013574
75%       0.743122     0.743826     0.634672     0.670587
max       3.000000     3.000000     3.000000     2.978884

In [86]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([1, 3, 2, 0, 4])

In [87]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [88]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [89]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [91]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=100, replace=True)
draws

2   -1
3    6
2   -1
1    7
1    7
4    4
0    5
4    4
4    4
3    6
3    6
0    5
3    6
4    4
1    7
3    6
4    4
4    4
0    5
4    4
0    5
4    4
2   -1
2   -1
1    7
4    4
4    4
0    5
1    7
3    6
    ..
3    6
1    7
4    4
4    4
3    6
1    7
1    7
1    7
3    6
3    6
4    4
3    6
4    4
3    6
4    4
1    7
4    4
4    4
0    5
2   -1
3    6
1    7
1    7
0    5
4    4
4    4
3    6
2   -1
2   -1
3    6
Length: 100, dtype: int64

In [92]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [97]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [98]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [99]:
df_with_dummy = df[['data1']].join(dummies)

In [101]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [126]:
# %cd  examples/
mnames = ['movie_id', 'title', 'games']
movies = pd.read_table('../datasets/movielens/movies.dat', sep='::', header=None,
                      names=mnames)
movies.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: read_table is deprecated, use read_csv instead.
  after removing the cwd from sys.path.
C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  after removing the cwd from sys.path.

   movie_id                               title                         games
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [7]:
all_genres = []
for x in movies.games:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [8]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [14]:
gen = movies.games[0]
gen

"Animation|Children's|Comedy"

In [15]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [16]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [18]:
for i, gen in enumerate(movies.games):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [19]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [24]:
movies_windic.iloc[10]

movie_id                                         11
title                American President, The (1995)
games                          Comedy|Drama|Romance
Genre_Animation                                   0
Genre_Children's                                  0
Genre_Comedy                                      1
Genre_Adventure                                   0
Genre_Fantasy                                     0
Genre_Romance                                     1
Genre_Drama                                       1
Genre_Action                                      0
Genre_Crime                                       0
Genre_Thriller                                    0
Genre_Horror                                      0
Genre_Sci-Fi                                      0
Genre_Documentary                                 0
Genre_War                                         0
Genre_Musical                                     0
Genre_Mystery                                     0
Genre_Film-Noir                                   0
Genre_Western                                     0
Name: 10, dtype: object

In [25]:
np.random.seed(12345)

In [26]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [44]:
bins = [0,0.2,0.6,0.8, 1]

In [45]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           1
1           0           1           0           0
2           1           0           0           0
3           0           1           0           0
4           0           1           0           0
5           0           1           0           0
6           0           0           0           1
7           0           0           1           0
8           0           0           1           0
9           0           0           1           0

7.3  String Manipulation

In [46]:
val = 'a, b, guido'
val.split(',')

['a', ' b', ' guido']

In [47]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [48]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [49]:
'::'.join(pieces)

'a::b::guido'

In [50]:
'guido' in val

True

In [51]:
val.index(',')

1

In [53]:
val.find('3')

-1

In [55]:
val.count('4')

0

In [56]:
val.replace(',','::')

'a:: b:: guido'

In [57]:
val.replace(',','  ')

'a   b   guido'

In [58]:
import re
text = 'foo    bar\tbaz   \tqux'
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [59]:
regex = re.compile('\s+')
regex

re.compile(r'\s+', re.UNICODE)

In [60]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [61]:
regex.findall(text)

['    ', '\t', '   \t']

In [63]:
text = '''Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
'''
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [64]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [65]:
m = regex.search(text)
m

In [66]:
text[m.start():m.end()]

'dave@google.com'

In [68]:
print(regex.match(text))

None

In [69]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [91]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [96]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [99]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [100]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [101]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
       'Rob': 'rob@gmail.com', 'Wes':np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [102]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [103]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [104]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [105]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [106]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [107]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [108]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [111]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [112]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [113]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [114]:
data.str.islower()

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [117]:
data.str.join('1')

Dave     d1a1v1e1@1g1o1o1g1l1e1.1c1o1m
Steve    s1t1e1v1e1@1g1m1a1i1l1.1c1o1m
Rob          r1o1b1@1g1m1a1i1l1.1c1o1m
Wes                                NaN
dtype: object

In [123]:
data.str.pad(20)

Dave          dave@google.com
Steve         steve@gmail.com
Rob             rob@gmail.com
Wes                       NaN
dtype: object

In [125]:
type(data)

pandas.core.series.Series

In [135]:
type(movies.iloc[:,[0,1]])

pandas.core.frame.DataFrame

1.看到本章中很多字符串相关的 处理转换都是基于 Series里面的.str.某某方法来实现的，假如某个dataframe里面有几列同时需要进行某个方法处理，是否通常都是分别选中某列，然后基于Series的方式来处理比较合适？有没有其它更便利的操作方式

2.strip(), lstrip(), rstrip()分别用于去除字符串两边特定字符，去除左边特定字符，去除右边特定字符